
clc
clear all
%---------------导入决策矩阵------%
X=load('data2.txt');
w=[0.3 0.4 0.3];%属性权重
%---------------计算加权决策矩阵------%
n=4;   %------方案的个数
k=5;   %------专家的个数
m=3;   %------属性指标的个数
for j=1:(n*k)
     for i=1:m
         Y(j,1+(i-1)*4)=1-(1-X(j,1+(i-1)*4))^w(i);
         Y(j,2+(i-1)*4)=1-(1-X(j,2+(i-1)*4))^w(i);
         Y(j,3+(i-1)*4)=(X(j,3+(i-1)*4))^w(i);
         Y(j,4+(i-1)*4)=(X(j,4+(i-1)*4))^w(i);
     end
end
%-------------------------------------------------------%

%---------------计算正理想和负理想----------------%
for jj=1:k
        for ii=1:m
        Z(jj,1+4*(ii-1))=max(Y([jj jj+k jj+k*2 jj+k*3],1+4*(ii-1)));
        Z(jj,2+4*(ii-1))=max(Y([jj jj+k jj+k*2 jj+k*3],2+4*(ii-1)));
        Z(jj,3+4*(ii-1))=min(Y([jj jj+k jj+k*2 jj+k*3],3+4*(ii-1)));
        Z(jj,4+4*(ii-1))=min(Y([jj jj+k jj+k*2 jj+k*3],4+4*(ii-1)));
        F(jj,1+4*(ii-1))=min(Y([jj jj+k jj+k*2 jj+k*3],1+4*(ii-1)));
        F(jj,2+4*(ii-1))=min(Y([jj jj+k jj+k*2 jj+k*3],2+4*(ii-1)));
        F(jj,3+4*(ii-1))=max(Y([jj jj+k jj+k*2 jj+k*3],3+4*(ii-1)));
        F(jj,4+4*(ii-1))=max(Y([jj jj+k jj+k*2 jj+k*3],4+4*(ii-1)));
        end
end

%---------------计算每个备选方案与正负理想的欧式距离----------------%
DYZ=zeros(n,k);
DYF=zeros(n,k);
for j=1:n
    YY=Y(1+(j-1)*k:j*k,:);
    for kk=1:k
       for i=1:m
          
          DYZ(j,kk)=DYZ(j,kk)+(((Z(kk,1+(i-1)*4))-(YY(kk,1+(i-1)*4)))^2+((Z(kk,2+(i-1)*4))-(YY(kk,2+(i-1)*4)))^2+((Z(kk,3+(i-1)*4))-(YY(kk,3+(i-1)*4)))^2+((Z(kk,4+(i-1)*4))-(YY(kk,4+(i-1)*4)))^2+((1-(Z(kk,1+(i-1)*4))-Z(kk,3+(i-1)*4))-(1-(YY(kk,1+(i-1)*4))-YY(kk,3+(i-1)*4)))^2+((1-(Z(kk,2+(i-1)*4))-Z(kk,4+(i-1)*4))-(1-(YY(kk,2+(i-1)*4))-YY(kk,4+(i-1)*4)))^2)^0.5;
          DYF(j,kk)=DYF(j,kk)+(((F(kk,1+(i-1)*4))-(YY(kk,1+(i-1)*4)))^2+((F(kk,2+(i-1)*4))-(YY(kk,2+(i-1)*4)))^2+((F(kk,3+(i-1)*4))-(YY(kk,3+(i-1)*4)))^2+((F(kk,4+(i-1)*4))-(YY(kk,4+(i-1)*4)))^2+((1-(F(kk,1+(i-1)*4))-F(kk,3+(i-1)*4))-(1-(YY(kk,1+(i-1)*4))-YY(kk,3+(i-1)*4)))^2+((1-(F(kk,2+(i-1)*4))-F(kk,4+(i-1)*4))-(1-(YY(kk,2+(i-1)*4))-YY(kk,4+(i-1)*4)))^2)^0.5;
       end
    end
    DDYZ(j)=sum(DYZ(j,:));
    DDYF(j)=sum(DYF(j,:));
end


%---------------计算相对贴进度----------------%
for i=1:n
    Q(i)=DDYF(i)/(DDYF(i)+DDYZ(i));
end
disp(Q);